#include <iostream>
#include <cmath>

int main() {
    // Опис операнд?в у пам'ят?
    float A = 2.5;    // коеф?ц?єнт для n^2
    float B = 3.3;    // коеф?ц?єнт для n
    float C = -4;     // константа
    long N = 0, sum = 0;
    float an;         // для збер?гання поточного елемента прогрес?ї

    // Ассемблерна вставка
    __asm {
        finit           // Очищення рег?стр?в FPU
        fldz            // Завантаження 0 у стек як початок суми
        m1 :
        inc N           // Нарощування аргументу n
            fld A           // Завантаження коеф?ц?єнта A
            fimul N         // Обчислення A * n^2
            fld B           // Завантаження коеф?ц?єнта B
            fimul N         // Обчислення B * n
            fadd C          // Додавання C
            faddp ST(1), ST // Сума результат?в

            fsqrt           // Обчислення квадратного кореня
            fstp an         // Збереження результату в зм?нну an
            fadd an         // Додавання до поточної суми
            fist sum        // Збереження результату суми

            // Пор?вняння, чи перевищила сума 100
            mov eax, sum    // Завантаження суми в рег?стр EAX
            cmp eax, 100    // Пор?вняння з 100
            jl m1           // Якщо сума менше 100, продовжуємо цикл
    }

    // Виведення результату
    std::cout << "Номер елемента прогрес?ї, при якому сума перевищить 100: " << N << std::endl;

    return 0;
}
